<script setup lang="ts">
const navigation = useRouterJson()

const route = useRoute()
</script>

<template>
    <div class="container px-4 mx-auto sm:px-6 lg:px-8 max-w-7xl">
        <div class="flex flex-col lg:grid lg:grid-cols-10 lg:gap-8">
            <!-- Article 1 -->
            <div class="mb-32 lg:col-span-10">
                <article class="flex-grow mx-8 my-8 break-words ">
                    <section>
                        <h1 id="สินค้าและบริการ" class="text-4xl font-bold text-center">
                            สินค้าและบริการ
                        </h1>
                        <p class="text-lg text-center">
                            สร้างโลกของความแข็งแกร่งและคุณภาพด้วยวัสดุก่อสร้างจากเรา!
                            เราเสนอสินค้าที่มีคุณภาพสูงที่สุดในวงการและมาพร้อมกับความคุ้มค่าที่ยอดเยี่ยม
                            ไม่ว่าคุณกำลังก่อสร้างบ้านหรือโครงการใหญ่ ๆ
                            เรามีทุกอย่างที่คุณต้องการเพื่อให้โครงการของคุณประสบความสำเร็จ
                        </p>
                        <br>
                        <hr>
                        <br>
                    </section>
                    <section>
                        <h2 id="รางระบายน้ำพร้อมฝาปิด-คอนกรีตสำเร็จรูป"
                            class="text-3xl font-bold text-start scroll-mt-[calc(40px+var(--header-height))] lg:scroll-mt-[calc(40px+var(--header-height))]">
                            รางระบายน้ำพร้อมฝาปิด คอนกรีตสำเร็จรูป
                        </h2>
                        <p class="text-lg text-start">
                            รางระบายน้ำคอนกรีตสำเร็จรูปพร้อมฝาปิด ของบริษัทสยามน้ำรินจำกัด มีความ แข็งแรงทนทาน
                            สะดวกในการติดตั้งใช้เวลาน้อย รักษาความสะอาดง่าย มีวิธีการเชื่อมต่อเป็นเนื้อเดียวกัน
                            มีแบบฝาปิด
                            ทั้งคอนกรีตหรือฝาตะแกรงเหล็ก
                        </p>
                        <br>

                        <h4 class="text-xl font-semibold text-start">
                            ตัวอย่าง รางระบายน้ำคอนกรีตสำเร็จรูปพร้อมฝาปิด ของ บริษัทสยามน้ำรินจำกัด
                        </h4>
                        <ul class="leading-8 ">
                            <li>
                                <NuxtLink to="#">*ฝารางระบายน้ำ IB - C7 รูเหลี่ยม</NuxtLink>
                            </li>
                            <li>*รางระบายน้ำ IB – 20 ประกอบฝา</li>
                            <li>*ฝาปิดสำหรับรางระบายน้ำขนาดภายในกว้าง 30 ซม. (มีร่องมือจับ)</li>
                            <li>*ฝารางสำหรับรางกว้างภายใน 30 ซ.ม. แบบมีร่องระบายน้ำ ขนาด 40x50x5 ซ.ม. ใช้ 2 ฝา / 1 ราง
                            </li>
                            <li>*รูปแบบประกอบฝากับรางระบายน้ำแบบ (วางบนบ่า)</li>
                            <li>*ฝาปิดสำหรับรางระบายน้ำกว้าง 50 ซม. (ฝาแบบทึบมีร่องจับ) IB – C3</li>
                            <li>*ฝารางแบบมีร่องระบายน้ำ IB – C4 ใช้ 3 ฝา / 1ราง</li>
                            <li>*รูปแบบประกอบฝากับรางระบายน้ำแบบ (วางบนบ่า)</li>
                            <li>*รางระบายน้ำ IB-T20 ขนาด 22X100X20 ซม. / วิธีการติดตั้งรางระบายน้ำ SNR
                                รุ่นฝาเหล็กด้านล่าง</li>
                            <li>*รางระบายน้ำ IB-T30 ขนาด 30X100X30 ซม. / วิธีการติดตั้งรางระบายน้ำ SNR
                                รุ่นฝาเหล็กด้านล่าง</li>
                            <li>*รางระบายน้ำ IB-T35 ขนาด 30X100X50 ซม. / วิธีการติดตั้งรางระบายน้ำ SNR
                                รุ่นฝาเหล็กด้านล่าง</li>
                            <li>*รางระบายน้ำ IB-T50 ขนาด 50X100X50 ซม. / วิธีการติดตั้งรางระบายน้ำ SNR
                                รุ่นฝาเหล็กด้านล่าง</li>
                            <li>*รางระบายน้ำ ขนาดภายใน 15X100X15 ซม. / วิธีการติดตั้งรางระบายน้ำ SNR รุ่นฝาเหล็กด้านล่าง
                            </li>
                            <li>*รางระบายน้ำ IB-T30P / วิธีการติดตั้งรางระบายน้ำ SNR รุ่นฝาเหล็กด้านล่าง</li>
                            <li>*รางระบายน้ำ IB-T30P ขนาด 50X100X50 ซม. (มีบ่าเหล็กฉาก)</li>
                            <li>*ฝารางขนาด 67X50X10 ซม. (สำหรับรางกว้าง 50 ซม. ตกบ่า)</li>
                            <li>*ฝารางระบายน้ำแบบตะแกรงเหล็ก IB-C9 ชนิดมีบ่าฉาก</li>
                            <li>*รางระบายน้ำ ขนาดภายใน 30X95X30 ซม. ใส่ฝาตะแกรงแบบบ่าฉาก</li>
                            <li>*ฝารางแบบตะแกรงเหล็ก IB-C8 แบบวางบนบ่าราง</li>
                            <li>*รางระบายน้ำขนาดภายใน 0.30X0.95X0.30 ซม. มีฝาบ่ารับฝาตะแกรง</li>
                            <li>*ฝาปิดรางระบายน้ำร่อง V แบบรับน้ำหนัก IB – C6</li>
                            <li>*ภาพประกอบฝาราง IB-C6 กับราง IB-T30P และ IB-T35P</li>
                            <li>*ฝาปิดรางระบายน้ำชนิดรับน้ำหนัก IB-C5</li>
                            <li>*รูปแบบลักษณะการวางฝารับน้ำหนัก บนรางระบายน้ำแบบมีบ่ารับฝา</li>
                        </ul>
                    </section>
                    <br>
                    <section>
                        <h1 id="แผ่นสแลทปูพื้นคอกสำเร็จรูป"
                            class="text-4xl font-bold text-start scroll-mt-[calc(40px+var(--header-height))] lg:scroll-mt-[calc(40px+var(--header-height))]">
                            แผ่นสแลทปูพื้นคอกสำเร็จรูป
                        </h1>
                        <p class="text-lg text-start">
                            รางระบายน้ำคอนกรีตสำเร็จรูปพร้อมฝาปิด ของบริษัทสยามน้ำรินจำกัด มีความ
                            แข็งแรงทนทาน สะดวกในการติดตั้งใช้เวลาน้อย รักษาความสะอาดง่าย
                            มีวิธีการเชื่อมต่อเป็นเนื้อเดียวกัน
                            มีแบบฝาปิด
                            ทั้งคอนกรีตหรือฝาตะแกรงเหล็ก
                        </p>
                        <ul class="leading-8 ">
                            <li>
                                <NuxtLink to="#">*ฝารางระบายน้ำ IB - C7 รูเหลี่ยม</NuxtLink>
                            </li>
                            <li>*รางระบายน้ำ IB – 20 ประกอบฝา</li>
                            <li>*ฝาปิดสำหรับรางระบายน้ำขนาดภายในกว้าง 30 ซม. (มีร่องมือจับ)</li>
                            <li>*ฝารางสำหรับรางกว้างภายใน 30 ซ.ม. แบบมีร่องระบายน้ำ ขนาด 40x50x5 ซ.ม. ใช้ 2 ฝา / 1 ราง
                            </li>
                            <li>*รูปแบบประกอบฝากับรางระบายน้ำแบบ (วางบนบ่า)</li>
                            <li>*ฝาปิดสำหรับรางระบายน้ำกว้าง 50 ซม. (ฝาแบบทึบมีร่องจับ) IB – C3</li>
                            <li>*ฝารางแบบมีร่องระบายน้ำ IB – C4 ใช้ 3 ฝา / 1ราง</li>
                            <li>*รูปแบบประกอบฝากับรางระบายน้ำแบบ (วางบนบ่า)</li>
                            <li>*รางระบายน้ำ IB-T20 ขนาด 22X100X20 ซม. / วิธีการติดตั้งรางระบายน้ำ SNR
                                รุ่นฝาเหล็กด้านล่าง</li>
                            <li>*รางระบายน้ำ IB-T30 ขนาด 30X100X30 ซม. / วิธีการติดตั้งรางระบายน้ำ SNR
                                รุ่นฝาเหล็กด้านล่าง</li>
                            <li>*รางระบายน้ำ IB-T35 ขนาด 30X100X50 ซม. / วิธีการติดตั้งรางระบายน้ำ SNR
                                รุ่นฝาเหล็กด้านล่าง</li>
                            <li>*รางระบายน้ำ IB-T50 ขนาด 50X100X50 ซม. / วิธีการติดตั้งรางระบายน้ำ SNR
                                รุ่นฝาเหล็กด้านล่าง</li>
                            <li>*รางระบายน้ำ ขนาดภายใน 15X100X15 ซม. / วิธีการติดตั้งรางระบายน้ำ SNR รุ่นฝาเหล็กด้านล่าง
                            </li>
                            <li>*รางระบายน้ำ IB-T30P / วิธีการติดตั้งรางระบายน้ำ SNR รุ่นฝาเหล็กด้านล่าง</li>
                            <li>*รางระบายน้ำ IB-T30P ขนาด 50X100X50 ซม. (มีบ่าเหล็กฉาก)</li>
                            <li>*ฝารางขนาด 67X50X10 ซม. (สำหรับรางกว้าง 50 ซม. ตกบ่า)</li>
                            <li>*ฝารางระบายน้ำแบบตะแกรงเหล็ก IB-C9 ชนิดมีบ่าฉาก</li>
                            <li>*รางระบายน้ำ ขนาดภายใน 30X95X30 ซม. ใส่ฝาตะแกรงแบบบ่าฉาก</li>
                            <li>*ฝารางแบบตะแกรงเหล็ก IB-C8 แบบวางบนบ่าราง</li>
                            <li>*รางระบายน้ำขนาดภายใน 0.30X0.95X0.30 ซม. มีฝาบ่ารับฝาตะแกรง</li>
                            <li>*ฝาปิดรางระบายน้ำร่อง V แบบรับน้ำหนัก IB – C6</li>
                            <li>*ภาพประกอบฝาราง IB-C6 กับราง IB-T30P และ IB-T35P</li>
                            <li>*ฝาปิดรางระบายน้ำชนิดรับน้ำหนัก IB-C5</li>
                            <li>*รูปแบบลักษณะการวางฝารับน้ำหนัก บนรางระบายน้ำแบบมีบ่ารับฝา</li>
                        </ul>
                    </section>
                </article>
            </div>

            <!-- Right menu -->
            <div class="order-2 h-auto lg:col-span-2 lg:order-last">
                
            </div>

        </div>
    </div>
</template>