<script setup lang="ts">
useHead({
    title: 'บริษัท สยามน้ำริน จำกัด',
    meta: [
        { name: 'description', content: 'สินค้า คอนกรีต สำเร็จรูป รวมถึงงานออกแบบ และงานก่อสร้าง บริษัทสยามน้ำรินจำกัด มีเจ้าหน้าที่เป็นผู้เชี่ยวชาญด้านการออกแบบและวางระบบต่าง ๆ โดยเฉพาะ โรงเลี้ยงสัตว์ ฟาร์มสัตว์ บ้าน หรือโรงงาน โปรดรับ บริษัทสยามน้ำรินจำกัด เป็นอีกหนึ่งทางเลือก ทางบริษัทฯ ยินดีรับฟัง และ พร้อมให้คำแนะนำ เพื่อประโยชน์สูงสุดของลูกค้า เน้น คุณภาพ และ รับประกันราคา จากโรงงานแน่นอน' }
    ],
    bodyAttrs: {
        class: 'test'
    },
    script: [{ innerHTML: 'console.log(\'Hello world\')' }]
})
</script>

<template>
    <div class="h-full min-h-[600px]">
        <!-- Slider -->
        <Carousel />
        <!-- End Slider -->
        <div class="w-auto h-auto p-8">
            <div>
                <h1 class="text-4xl font-extrabold text-primary">
                    บริษัทสยามน้ำรินจำกัด
                </h1>
                <p class="text-xl">
                    จำหน่าย และให้บริการ สินค้า <strong>คอนกรีต</strong> สำเร็จรูป รวมถึงงานออกแบบ และงานก่อสร้าง
                    บริษัทสยามน้ำรินจำกัด
                    มีเจ้าหน้าที่เป็นผู้เชี่ยวชาญด้านการออกแบบและวางระบบต่าง ๆ โดยเฉพาะ โรงเลี้ยงสัตว์ ฟาร์มสัตว์ บ้าน
                    หรือโรงงาน โปรดรับ บริษัทสยามน้ำรินจำกัด เป็นอีกหนึ่งทางเลือก ทางบริษัทฯ ยินดีรับฟัง และ
                    พร้อมให้คำแนะนำ
                    เพื่อประโยชน์สูงสุดของลูกค้า เน้น คุณภาพ และ รับประกันราคา จากโรงงานแน่นอน
                </p>
            </div>
            <br>
            <div>
                <div class="text-2xl font-semibold text-secondary">
                    สนใจติดต่อสอบถามรายละเอียดได้ที่
                </div>
                <p class="text-lg">
                    คุณเอ โทร. <strong class="text-neutral">088-909-3896</strong> ID LINE: <strong
                        class="text-neutral">teeruka</strong>
                </p>
            </div>
            <br>
            <div>
                <div class="text-2xl font-semibold text-secondary">
                    รางน้ำคอนกรีตสำเร็จรูป
                </div>
                <p class="text-lg">
                    รางระบายน้ำคอนกรีตสำเร็จรูปพร้อมฝาปิด ของ SNR มีความ แข็งแรงทนทาน สะดวกในการติดตั้งใช้เวลาน้อย
                    รักษาความสะอาดง่าย มีวิธีการเชื่อมต่อเป็นเนื้อเดียวกัน มีแบบฝาปิด ทั้งคอนกรีตหรือฝาตะแกรงเหล็ก
                </p>
            </div>
            <br>
            <div>
                <div class="text-2xl font-semibold text-secondary">
                    ผนังสำเร็จรูป ระบบ Knockdown
                </div>
                <p class="text-lg">
                    ระบบ Knockdown ผลิตจากคอนกรีตเสริมเหล็ก เทคโนโลยีเดียวกับประเทศเดนมาร์ก ด้วยการออกแบบในระบบ
                    Knockdown ทำ
                    ให้สามารถนำผลิตภัณฑ์ไปประกอบได้ง่าย ประหยัดเวลา ใช้แรงงานในการก่อสร้างน้อย ไม่สิ้นเปลืองวัสดุอื่น
                    (เช่น
                    ไม้แบบ และอื่นๆ) สะดวก รวดเร็ว ประหยัดงบประมาณในการก่อสร้าง
                </p>
            </div>
        </div>
    </div>
</template>